MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/adchs.h
/* -------- ADCHS_ADCCMP0CLR : (ADCHS Offset: 0xF4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMP0CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMP0CLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMP0CLR) Register Mask  */


/* -------- ADCHS_ADCCMP0SET : (ADCHS Offset: 0xF8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMP0SET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP0SET) Bit set register  Reset Value */

#define ADCHS_ADCCMP0SET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMP0SET) Register Mask  */


/* -------- ADCHS_ADCCMP0INV : (ADCHS Offset: 0xFC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMP0INV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP0INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMP0INV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMP0INV) Register Mask  */


/* -------- ADCHS_ADCCMPEN2 : (ADCHS Offset: 0x100) (R/W 32)  -------- */
#define ADCHS_ADCCMPEN2_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN2)   Reset Value */

#define ADCHS_ADCCMPEN2_CMPE0_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE0_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE0_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE0(value)          (ADCHS_ADCCMPEN2_CMPE0_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE0_Pos)) /* Assigment of value for CMPE0 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE1_Pos             _UINT32_(1)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE1_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE1_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE1(value)          (ADCHS_ADCCMPEN2_CMPE1_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE1_Pos)) /* Assigment of value for CMPE1 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE2_Pos             _UINT32_(2)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE2_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE2_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE2(value)          (ADCHS_ADCCMPEN2_CMPE2_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE2_Pos)) /* Assigment of value for CMPE2 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE3_Pos             _UINT32_(3)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE3_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE3_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE3(value)          (ADCHS_ADCCMPEN2_CMPE3_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE3_Pos)) /* Assigment of value for CMPE3 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE4_Pos             _UINT32_(4)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE4_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE4_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE4(value)          (ADCHS_ADCCMPEN2_CMPE4_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE4_Pos)) /* Assigment of value for CMPE4 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE5_Pos             _UINT32_(5)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE5_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE5_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE5(value)          (ADCHS_ADCCMPEN2_CMPE5_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE5_Pos)) /* Assigment of value for CMPE5 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE6_Pos             _UINT32_(6)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE6_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE6_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE6(value)          (ADCHS_ADCCMPEN2_CMPE6_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE6_Pos)) /* Assigment of value for CMPE6 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_CMPE7_Pos             _UINT32_(7)                                          /* (ADCHS_ADCCMPEN2)  Position */
#define ADCHS_ADCCMPEN2_CMPE7_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN2_CMPE7_Pos)         /* (ADCHS_ADCCMPEN2)  Mask */
#define ADCHS_ADCCMPEN2_CMPE7(value)          (ADCHS_ADCCMPEN2_CMPE7_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE7_Pos)) /* Assigment of value for CMPE7 in the ADCHS_ADCCMPEN2 register */
#define ADCHS_ADCCMPEN2_Msk                   _UINT32_(0x000000FF)                                 /* (ADCHS_ADCCMPEN2) Register Mask  */

#define ADCHS_ADCCMPEN2_CMPE_Pos              _UINT32_(0)                                          /* (ADCHS_ADCCMPEN2 Position)  */
#define ADCHS_ADCCMPEN2_CMPE_Msk              (_UINT32_(0xFF) << ADCHS_ADCCMPEN2_CMPE_Pos)         /* (ADCHS_ADCCMPEN2 Mask) CMPE */
#define ADCHS_ADCCMPEN2_CMPE(value)           (ADCHS_ADCCMPEN2_CMPE_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE_Pos)) 

/* -------- ADCHS_ADCCMPEN1CLR : (ADCHS Offset: 0x104) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMPEN1CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMPEN1CLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN1CLR) Register Mask  */


/* -------- ADCHS_ADCCMPEN1SET : (ADCHS Offset: 0x108) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMPEN1SET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN1SET) Bit set register  Reset Value */

#define ADCHS_ADCCMPEN1SET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN1SET) Register Mask  */


/* -------- ADCHS_ADCCMPEN1INV : (ADCHS Offset: 0x10C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMPEN1INV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN1INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMPEN1INV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN1INV) Register Mask  */


/* -------- ADCHS_ADCCMP2 : (ADCHS Offset: 0x110) (R/W 32)  -------- */
#define ADCHS_ADCCMP2_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP2)   Reset Value */

#define ADCHS_ADCCMP2_ADCMPLO_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCMP2)  Position */
#define ADCHS_ADCCMP2_ADCMPLO_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCCMP2_ADCMPLO_Pos)      /* (ADCHS_ADCCMP2)  Mask */
#define ADCHS_ADCCMP2_ADCMPLO(value)          (ADCHS_ADCCMP2_ADCMPLO_Msk & (_UINT32_(value) << ADCHS_ADCCMP2_ADCMPLO_Pos)) /* Assigment of value for ADCMPLO in the ADCHS_ADCCMP2 register */
#define ADCHS_ADCCMP2_ADCMPHI_Pos             _UINT32_(16)                                         /* (ADCHS_ADCCMP2)  Position */
#define ADCHS_ADCCMP2_ADCMPHI_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCCMP2_ADCMPHI_Pos)      /* (ADCHS_ADCCMP2)  Mask */
#define ADCHS_ADCCMP2_ADCMPHI(value)          (ADCHS_ADCCMP2_ADCMPHI_Msk & (_UINT32_(value) << ADCHS_ADCCMP2_ADCMPHI_Pos)) /* Assigment of value for ADCMPHI in the ADCHS_ADCCMP2 register */
#define ADCHS_ADCCMP2_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCCMP2) Register Mask  */


