MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/adchs.h
/* -------- ADCHS_ADDCMP1CLR : (ADCHS Offset: 0x114) (R/W 32) Bit clear register -------- */
#define ADCHS_ADDCMP1CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADDCMP1CLR) Bit clear register  Reset Value */

#define ADCHS_ADDCMP1CLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADDCMP1CLR) Register Mask  */


/* -------- ADCHS_ADDCMP1SET : (ADCHS Offset: 0x118) (R/W 32) Bit set register -------- */
#define ADCHS_ADDCMP1SET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADDCMP1SET) Bit set register  Reset Value */

#define ADCHS_ADDCMP1SET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADDCMP1SET) Register Mask  */


/* -------- ADCHS_ADDCMP1INV : (ADCHS Offset: 0x11C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADDCMP1INV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADDCMP1INV) Bit invert register  Reset Value */

#define ADCHS_ADDCMP1INV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADDCMP1INV) Register Mask  */


/* -------- ADCHS_ADCFLTR1 : (ADCHS Offset: 0x1A0) (R/W 32)  -------- */
#define ADCHS_ADCFLTR1_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCFLTR1)   Reset Value */

#define ADCHS_ADCFLTR1_FLT_DATA0_Pos          _UINT32_(0)                                          /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_FLT_DATA0_Msk          (_UINT32_(0xFFFF) << ADCHS_ADCFLTR1_FLT_DATA0_Pos)   /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_FLT_DATA0(value)       (ADCHS_ADCFLTR1_FLT_DATA0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_FLT_DATA0_Pos)) /* Assigment of value for FLT_DATA0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_FLTINID0_Pos           _UINT32_(16)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_FLTINID0_Msk           (_UINT32_(0x1F) << ADCHS_ADCFLTR1_FLTINID0_Pos)      /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_FLTINID0(value)        (ADCHS_ADCFLTR1_FLTINID0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_FLTINID0_Pos)) /* Assigment of value for FLTINID0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_AFIF0_Pos              _UINT32_(24)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_AFIF0_Msk              (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFIF0_Pos)          /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_AFIF0(value)           (ADCHS_ADCFLTR1_AFIF0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFIF0_Pos)) /* Assigment of value for AFIF0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_AFIEN0_Pos             _UINT32_(25)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_AFIEN0_Msk             (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFIEN0_Pos)         /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_AFIEN0(value)          (ADCHS_ADCFLTR1_AFIEN0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFIEN0_Pos)) /* Assigment of value for AFIEN0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_OVRSAM0_Pos            _UINT32_(26)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_OVRSAM0_Msk            (_UINT32_(0x7) << ADCHS_ADCFLTR1_OVRSAM0_Pos)        /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_OVRSAM0(value)         (ADCHS_ADCFLTR1_OVRSAM0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_OVRSAM0_Pos)) /* Assigment of value for OVRSAM0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_ADFMODE0_Pos           _UINT32_(29)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_ADFMODE0_Msk           (_UINT32_(0x1) << ADCHS_ADCFLTR1_ADFMODE0_Pos)       /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_ADFMODE0(value)        (ADCHS_ADCFLTR1_ADFMODE0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_ADFMODE0_Pos)) /* Assigment of value for ADFMODE0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_DATA16EN0_Pos          _UINT32_(30)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_DATA16EN0_Msk          (_UINT32_(0x1) << ADCHS_ADCFLTR1_DATA16EN0_Pos)      /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_DATA16EN0(value)       (ADCHS_ADCFLTR1_DATA16EN0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_DATA16EN0_Pos)) /* Assigment of value for DATA16EN0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_AFEN0_Pos              _UINT32_(31)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_AFEN0_Msk              (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFEN0_Pos)          /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_AFEN0(value)           (ADCHS_ADCFLTR1_AFEN0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFEN0_Pos)) /* Assigment of value for AFEN0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_Msk                    _UINT32_(0xFF1FFFFF)                                 /* (ADCHS_ADCFLTR1) Register Mask  */

#define ADCHS_ADCFLTR1_AFIF_Pos               _UINT32_(24)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_AFIF_Msk               (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFIF_Pos)           /* (ADCHS_ADCFLTR1 Mask) AFIF */
#define ADCHS_ADCFLTR1_AFIF(value)            (ADCHS_ADCFLTR1_AFIF_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFIF_Pos)) 
#define ADCHS_ADCFLTR1_AFIEN_Pos              _UINT32_(25)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_AFIEN_Msk              (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFIEN_Pos)          /* (ADCHS_ADCFLTR1 Mask) AFIEN */
#define ADCHS_ADCFLTR1_AFIEN(value)           (ADCHS_ADCFLTR1_AFIEN_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFIEN_Pos)) 
#define ADCHS_ADCFLTR1_ADFMODE_Pos            _UINT32_(29)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_ADFMODE_Msk            (_UINT32_(0x1) << ADCHS_ADCFLTR1_ADFMODE_Pos)        /* (ADCHS_ADCFLTR1 Mask) ADFMODE */
#define ADCHS_ADCFLTR1_ADFMODE(value)         (ADCHS_ADCFLTR1_ADFMODE_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_ADFMODE_Pos)) 
#define ADCHS_ADCFLTR1_DATA16EN_Pos           _UINT32_(30)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_DATA16EN_Msk           (_UINT32_(0x1) << ADCHS_ADCFLTR1_DATA16EN_Pos)       /* (ADCHS_ADCFLTR1 Mask) DATA16EN */
#define ADCHS_ADCFLTR1_DATA16EN(value)        (ADCHS_ADCFLTR1_DATA16EN_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_DATA16EN_Pos)) 
#define ADCHS_ADCFLTR1_AFEN_Pos               _UINT32_(31)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_AFEN_Msk               (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFEN_Pos)           /* (ADCHS_ADCFLTR1 Mask) AFEN */
#define ADCHS_ADCFLTR1_AFEN(value)            (ADCHS_ADCFLTR1_AFEN_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFEN_Pos)) 

